
import { Product, Category } from './types';

// API Configuration
export const DEFAULT_API_URL = 'https://api.kurdkids.ir';
export const DEFAULT_CONSUMER_KEY = 'ck_e8b46a0bd487f3d3cb8266af7e5a3e40b9725b3a';
export const DEFAULT_CONSUMER_SECRET = 'cs_fdde7fac59842b8f75e422e8207500895adcbd1f';

export const formatPrice = (price: string | number) => {
  return Number(price).toLocaleString('fa-IR');
};

// Provinces and Cities of Iran
export const IRAN_LOCATIONS: { [key: string]: string[] } = {
    'تهران': ['تهران', 'اسلام‌شهر', 'گلستان', 'قدس', 'ملارد', 'ورامین', 'شهریار'],
    'خراسان رضوی': ['مشهد', 'نیشابور', 'سبزوار', 'تربت حیدریه', 'کاشمر', 'قوچان'],
    'اصفهان': ['اصفهان', 'کاشان', 'خمینی‌شهر', 'نجف‌آباد', 'شاهین‌شهر', 'شهرضا'],
    'فارس': ['شیراز', 'مرودشت', 'جهرم', 'فسا', 'کازرون', 'داراب'],
    'خوزستان': ['اهواز', 'دزفول', 'آبادان', 'ماهشهر', 'اندیمشک', 'خرمشهر'],
    'آذربایجان شرقی': ['تبریز', 'مراغه', 'مرند', 'میانه', 'اهر', 'بناب'],
    'مازندران': ['ساری', 'بابل', 'آمل', 'قائم‌شهر', 'بهشهر', 'چالوس'],
    'آذربایجان غربی': ['ارومیه', 'خوی', 'بوکان', 'مهاباد', 'میاندوآب', 'سلماس'],
    'کرمان': ['کرمان', 'سیرجان', 'رفسنجان', 'جیرفت', 'بم', 'زرند'],
    'گیلان': ['رشت', 'بندر انزلی', 'لاهیجان', 'لنگرود', 'هشتپر', 'آستارا'],
    'سیستان و بلوچستان': ['زاهدان', 'زابل', 'ایرانشهر', 'چابهار', 'سراوان', 'خاش'],
    'البرز': ['کرج', 'فردیس', 'کمال‌شهر', 'نظرآباد', 'محمدشهر', 'ماهدشت'],
    'کرمانشاه': ['کرمانشاه', 'اسلام‌آباد غرب', 'جوانرود', 'کنگاور', 'سنقر', 'هرسین'],
    'گلستان': ['گرگان', 'گنبد کاووس', 'علی‌آباد کتول', 'بندر ترکمن', 'آزادشهر', 'کردکوی'],
    'هرمزگان': ['بندرعباس', 'میناب', 'دهبارز', 'بندر لنگه', 'قشم', 'کیش'],
    'لرستان': ['خرم‌آباد', 'بروجرد', 'دورود', 'الیگودرز', 'کوهدشت', 'نورآباد'],
    'همدان': ['همدان', 'ملایر', 'نهاوند', 'اسدآباد', 'تویسرکان', 'بهار'],
    'کردستان': ['سنندج', 'سقز', 'مریوان', 'بانه', 'قروه', 'کامیاران'],
    'مرکزی': ['اراک', 'ساوه', 'خمین', 'محلات', 'دلیجان', 'شازند'],
    'قم': ['قم', 'جعفریه', 'قنوات', 'دستجرد', 'کهک'],
    'قزوین': ['قزوین', 'الوند', 'تاکستان', 'بوئین‌زهرا', 'اقبالیه', 'آبیک'],
    'اردبیل': ['اردبیل', 'پارس‌آباد', 'مشگین‌شهر', 'خلخال', 'گرمی', 'بیله‌سوار'],
    'بوشهر': ['بوشهر', 'برازجان', 'بندر گناوه', 'بندر کنگان', 'خورموج', 'جم'],
    'یزد': ['یزد', 'میبد', 'اردکان', 'بافق', 'مهریز', 'ابرکوه'],
    'زنجان': ['زنجان', 'ابهر', 'خرمدره', 'قیدار', 'هیدج', 'صائین‌قلعه'],
    'چهارمحال و بختیاری': ['شهرکرد', 'بروجن', 'لردگان', 'فرخ‌شهر', 'فارسان', 'هفشجان'],
    'خراسان جنوبی': ['بیرجند', 'قائن', 'طبس', 'فردوس', 'نهبندان', 'بشرویه'],
    'خراسان شمالی': ['بجنورد', 'شیروان', 'اسفراین', 'آشخانه', 'جاجرم', 'گرمه'],
    'سمنان': ['سمنان', 'شاهرود', 'دامغان', 'گرمسار', 'مهدی‌شهر', 'سرخه'],
    'ایلام': ['ایلام', 'دهلران', 'ایوان', 'آبدانان', 'دره‌شهر', 'مهران'],
    'کهگیلویه و بویراحمد': ['یاسوج', 'دوگنبدان', 'دهدشت', 'لیکک', 'چرام', 'لنده']
};
